HomeWork-3/reports/local-withIndex-wrk2-R200.txt
Running 1m test @ http://localhost:5000
  8 threads and 50 connections
  Thread calibration: mean lat.: 2834.896ms, rate sampling interval: 10043ms
  Thread calibration: mean lat.: 2799.839ms, rate sampling interval: 11042ms
  Thread calibration: mean lat.: 2405.973ms, rate sampling interval: 9797ms
  Thread calibration: mean lat.: 2911.196ms, rate sampling interval: 10846ms
  Thread calibration: mean lat.: 2877.222ms, rate sampling interval: 11550ms
  Thread calibration: mean lat.: 3004.690ms, rate sampling interval: 11935ms
  Thread calibration: mean lat.: 2815.141ms, rate sampling interval: 11091ms
  Thread calibration: mean lat.: 2644.988ms, rate sampling interval: 10027ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.24s    10.84s   44.30s    53.96%
    Req/Sec     5.58      1.50     8.00     93.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.28s 
 75.000%   32.08s 
 90.000%   37.00s 
 99.000%   41.48s 
 99.900%   43.84s 
 99.990%   44.34s 
 99.999%   44.34s 
100.000%   44.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3928.063     0.000000            1         1.00
    7852.031     0.100000          243         1.11
    9871.359     0.200000          486         1.25
   13844.479     0.300000          728         1.43
   18300.927     0.400000          972         1.67
   22282.239     0.500000         1214         2.00
   24526.847     0.550000         1336         2.22
   25985.023     0.600000         1456         2.50
   27738.111     0.650000         1577         2.86
   29868.031     0.700000         1699         3.33
   32079.871     0.750000         1821         4.00
   33030.143     0.775000         1882         4.44
   33685.503     0.800000         1941         5.00
   34799.615     0.825000         2003         5.71
   35586.047     0.850000         2064         6.67
   36306.943     0.875000         2128         8.00
   36634.623     0.887500         2156         8.89
   37027.839     0.900000         2185        10.00
   37519.359     0.912500         2214        11.43
   37945.343     0.925000         2245        13.33
   38371.327     0.937500         2275        16.00
   38600.703     0.943750         2291        17.78
   38895.615     0.950000         2307        20.00
   39124.991     0.956250         2323        22.86
   39321.599     0.962500         2338        26.67
   39550.975     0.968750         2353        32.00
   39682.047     0.971875         2359        35.56
   39878.655     0.975000         2366        40.00
   40075.263     0.978125         2373        45.71
   40468.479     0.981250         2381        53.33
   40730.623     0.984375         2389        64.00
   40959.999     0.985938         2392        71.11
   41254.911     0.987500         2396        80.00
   41418.751     0.989062         2400        91.43
   41648.127     0.990625         2404       106.67
   41746.431     0.992188         2408       128.00
   41779.199     0.992969         2410       142.22
   41877.503     0.993750         2411       160.00
   41975.807     0.994531         2413       182.86
   42205.183     0.995313         2415       213.33
   42598.399     0.996094         2417       256.00
   42795.007     0.996484         2418       284.44
   42991.615     0.996875         2419       320.00
   43188.223     0.997266         2420       365.71
   43286.527     0.997656         2421       426.67
   43319.295     0.998047         2422       512.00
   43319.295     0.998242         2422       568.89
   43515.903     0.998437         2423       640.00
   43515.903     0.998633         2423       731.43
   43843.583     0.998828         2424       853.33
   43843.583     0.999023         2424      1024.00
   43843.583     0.999121         2424      1137.78
   43941.887     0.999219         2425      1280.00
   43941.887     0.999316         2425      1462.86
   43941.887     0.999414         2425      1706.67
   43941.887     0.999512         2425      2048.00
   43941.887     0.999561         2425      2275.56
   44335.103     0.999609         2426      2560.00
   44335.103     1.000000         2426          inf
#[Mean    =    22239.084, StdDeviation   =    10838.891]
#[Max     =    44302.336, Total count    =         2426]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  349.18ms
 75.000%    1.31s 
 90.000%    2.28s 
 99.000%    3.28s 
 99.900%    4.04s 
 99.990%    4.85s 
 99.999%    4.85s 
100.000%    4.85s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.851     0.000000            1         1.00
      19.711     0.100000          243         1.11
      32.863     0.200000          486         1.25
      52.383     0.300000          728         1.43
     101.119     0.400000          971         1.67
     349.183     0.500000         1213         2.00
     569.855     0.550000         1337         2.22
     747.007     0.600000         1456         2.50
     889.855     0.650000         1577         2.86
    1078.271     0.700000         1699         3.33
    1305.599     0.750000         1820         4.00
    1428.479     0.775000         1881         4.44
    1583.103     0.800000         1941         5.00
    1765.375     0.825000         2002         5.71
    1927.167     0.850000         2063         6.67
    2103.295     0.875000         2123         8.00
    2185.215     0.887500         2154         8.89
    2281.471     0.900000         2184        10.00
    2367.487     0.912500         2215        11.43
    2469.887     0.925000         2247        13.33
    2551.807     0.937500         2275        16.00
    2603.007     0.943750         2290        17.78
    2646.015     0.950000         2305        20.00
    2719.743     0.956250         2320        22.86
    2801.663     0.962500         2336        26.67
    2920.447     0.968750         2351        32.00
    2936.831     0.971875         2360        35.56
    2988.031     0.975000         2366        40.00
    3022.847     0.978125         2373        45.71
    3102.719     0.981250         2381        53.33
    3127.295     0.984375         2389        64.00
    3151.871     0.985938         2392        71.11
    3209.215     0.987500         2396        80.00
    3254.271     0.989062         2400        91.43
    3307.519     0.990625         2404       106.67
    3377.151     0.992188         2408       128.00
    3444.735     0.992969         2409       142.22
    3467.263     0.993750         2411       160.00
    3479.551     0.994531         2413       182.86
    3512.319     0.995313         2415       213.33
    3536.895     0.996094         2417       256.00
    3567.615     0.996484         2418       284.44
    3569.663     0.996875         2419       320.00
    3579.903     0.997266         2420       365.71
    3606.527     0.997656         2421       426.67
    3704.831     0.998047         2422       512.00
    3704.831     0.998242         2422       568.89
    3782.655     0.998437         2423       640.00
    3782.655     0.998633         2423       731.43
    4038.655     0.998828         2424       853.33
    4038.655     0.999023         2424      1024.00
    4038.655     0.999121         2424      1137.78
    4419.583     0.999219         2425      1280.00
    4419.583     0.999316         2425      1462.86
    4419.583     0.999414         2425      1706.67
    4419.583     0.999512         2425      2048.00
    4419.583     0.999561         2425      2275.56
    4849.663     0.999609         2426      2560.00
    4849.663     1.000000         2426          inf
#[Mean    =      782.356, StdDeviation   =      916.020]
#[Max     =     4845.568, Total count    =         2426]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3197 requests in 1.00m, 2.60MB read
Requests/sec:     53.25
Transfer/sec:     44.35KB